In [1]:
# Memecah nilai string menjadi beberapa kolom

import pandas as pd

In [5]:
data = {'nama':['Didi Kempot','Glenn Fredly','Mbah Surip'],
        'tempat_kelahiran':['Surakarta, Jawa Tengah','Jakrta, DKI Jakarta','Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly     Jakrta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

In [6]:
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly     Jakrta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [7]:
df[['kota','provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakrta, DKI Jakarta",Glenn,Fredly,Jakrta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur